[AdventPriestArmor X2ArmorTemplate]
FriendlyName="变种人祭司护甲"
FriendlyNamePlural="变种人祭司护甲"
BriefSummary="祭司的护甲包含先进的灵能技术。我们不清楚这件护甲的使用者是否真正具有灵能天赋，或者变种人的基因操纵是否在起作用。这种护甲旨在放大灵能潜力，同时还提供内置的安全防护机制。我认为长老们旨在保护他们所谓的祭司。"
TacticalText="<Bullet/>祭司的护甲包含先进的灵能技术。我们不清楚这件护甲的使用者是否真正具有灵能天赋，或者变种的基因操纵是否在起作用。这种护甲旨在放大灵能潜力，同时还提供内置的安全防护机制。我认为长老们旨在保护他们所谓的祭司。"


[AdventPriestArmorDetectionStat X2AbilityTemplate]
LocFriendlyName="欺骗"
LocLongDescription="变种人在初次接敌中将几乎不可能发现这名士兵。"
LocHelpText="变种人在初次接敌中将几乎不可能发现这名士兵。"
LocFlyOverText="变种人在初次接敌中将几乎不可能发现这名士兵。"
LocPromotionPopupText="<Bullet/> 变种人在初次接敌中将几乎不可能发现这名士兵。"


[AdventPriestArmorUniquePassive X2AbilityTemplate]
LocFriendlyName="灵能增幅"
LocLongDescription=" 变种人祭司的护甲提供了更高的灵能潜力和自带的维生协议。"
LocHelpText=" 变种人祭司的护甲提供了更高的灵能潜力和自带的维生协议。"
LocFlyOverText=" 变种人祭司的护甲提供了更高的灵能潜力和自带的维生协议。"
LocPromotionPopupText="<Bullet/> 变种人祭司的护甲提供了更高的灵能潜力和自带的维生协议。"
